backend/performance/artillery-config.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm-up phase"

    - duration: 60
      arrivalRate: 5
      rampTo: 25
      name: "Ramp-up phase"

    - duration: 60
      arrivalRate: 25
      name: "Sustained load"

    - duration: 30
      arrivalRate: 50
      name: "Spike test"

    - duration: 30
      arrivalRate: 5
      name: "Cool down"

  ensure:
    maxErrorRate: 5          
    p95: 2000                 
    p99: 3000              

  plugins:
    expect: {}

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/test"
          expect:
            - statusCode: 200

  - name: "Get Growth Records"
    weight: 20
    flow:
      - get:
          url: "/api/growth"
          expect:
            - statusCode: 200
            - contentType: json

  - name: "Get Sleep Records"
    weight: 20
    flow:
      - get:
          url: "/api/sleep"
          expect:
            - statusCode: 200

  - name: "Get Feeding Records"
    weight: 15
    flow:
      - get:
          url: "/api/feeding"
          expect:
            - statusCode: 200

  - name: "Get Observation Records"
    weight: 15
    flow:
      - get:
          url: "/api/observation"
          expect:
            - statusCode: 200

  - name: "Get Allergies"
    weight: 10
    flow:
      - get:
          url: "/api/allergies"
          expect:
            - statusCode: 200

  - name: "Get Medications"
    weight: 10
    flow:
      - get:
          url: "/api/meds"
          expect:
            - statusCode: 200