backend/performance/artillery-config.yml
# Artillery Load Testing Configuration
# This file defines load testing scenarios for the ParentPal API

config:
  target: "http://localhost:3000"
  phases:
    # Phase 1: Warm-up (gradually increase load)
    - duration: 60
      arrivalRate: 5
      name: "Warm-up phase"

    # Phase 2: Ramp-up (increase load)
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up phase"

    # Phase 3: Sustained load (constant high load)
    - duration: 180
      arrivalRate: 50
      name: "Sustained load"

    # Phase 4: Spike test (sudden high load)
    - duration: 60
      arrivalRate: 100
      name: "Spike test"

    # Phase 5: Cool down
    - duration: 60
      arrivalRate: 10
      name: "Cool down"

  # Performance thresholds (tests fail if these are exceeded)
  ensure:
    maxErrorRate: 1           # Max 1% error rate
    p95: 500                  # 95th percentile response time < 500ms
    p99: 1000                 # 99th percentile response time < 1000ms

  # Plugins for enhanced reporting
  plugins:
    expect: {}

  # HTTP defaults
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # Scenario 1: Health Check
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/test"
          expect:
            - statusCode: 200

  # Scenario 2: Get Growth Records
  - name: "Get Growth Records"
    weight: 20
    flow:
      - get:
          url: "/api/growth"
          expect:
            - statusCode: 200
            - contentType: json

  # Scenario 3: Get Sleep Records
  - name: "Get Sleep Records"
    weight: 20
    flow:
      - get:
          url: "/api/sleep"
          expect:
            - statusCode: 200

  # Scenario 4: Get Feeding Records
  - name: "Get Feeding Records"
    weight: 15
    flow:
      - get:
          url: "/api/feeding"
          expect:
            - statusCode: 200

  # Scenario 5: Get Observation Records
  - name: "Get Observation Records"
    weight: 15
    flow:
      - get:
          url: "/api/observation"
          expect:
            - statusCode: 200

  # Scenario 6: Get Allergies
  - name: "Get Allergies"
    weight: 10
    flow:
      - get:
          url: "/api/allergies"
          expect:
            - statusCode: 200

  # Scenario 7: Get Medications
  - name: "Get Medications"
    weight: 10
    flow:
      - get:
          url: "/api/meds"
          expect:
            - statusCode: 200

# Note: POST requests require valid test data
# Consider creating a separate config for write operations with proper test data