backend/performance/artillery-write-ops.yml
# Artillery Load Testing Configuration - Write Operations
# Tests POST/PUT/DELETE operations with realistic data

config:
  target: "http://localhost:3000"
  phases:
    # Light load for write operations
    - duration: 60
      arrivalRate: 2
      name: "Light write operations"

    - duration: 120
      arrivalRate: 2
      rampTo: 10
      name: "Ramp-up writes"

    - duration: 60
      arrivalRate: 10
      name: "Sustained writes"

  ensure:
    maxErrorRate: 5           # Allow 5% error rate for writes (data validation)
    p95: 1000                 # 95th percentile < 1 second
    p99: 2000                 # 99th percentile < 2 seconds

  defaults:
    headers:
      Content-Type: "application/json"

  # Variables for test data
  variables:
    baby_id:
      - 1
      - 2
      - 3

scenarios:
  # Scenario 1: Create and read growth record
  - name: "Growth Record Workflow"
    weight: 25
    flow:
      - post:
          url: "/api/growth"
          json:
            baby_id: "{{ baby_id }}"
            weight: "{{ $randomNumber(5, 15) }}"
            height: "{{ $randomNumber(40, 80) }}"
            date: "2024-01-{{ $randomNumber(1, 28) }}"
          capture:
            - json: "$.growth_id"
              as: "growth_id"

      - think: 1

      - get:
          url: "/api/growth?baby_id={{ baby_id }}"

  # Scenario 2: Sleep record workflow
  - name: "Sleep Record Workflow"
    weight: 25
    flow:
      - post:
          url: "/api/sleep"
          json:
            baby_id: "{{ baby_id }}"
            sleep_duration: "{{ $randomNumber(4, 12) }}"
            time_fell_asleep: "{{ $randomNumber(19, 23) }}:00"
            date: "2024-01-{{ $randomNumber(1, 28) }}"

      - think: 1

      - get:
          url: "/api/sleep?baby_id={{ baby_id }}"

  # Scenario 3: Feeding record workflow
  - name: "Feeding Record Workflow"
    weight: 25
    flow:
      - post:
          url: "/api/feeding"
          json:
            baby_id: "{{ baby_id }}"
            time_fed: "{{ $randomNumber(6, 22) }}:00"
            date: "2024-01-{{ $randomNumber(1, 28) }}"
            fed_from: "bottle"
            type_of_food: "formula"
            amount: "{{ $randomNumber(4, 8) }}"

      - think: 1

      - get:
          url: "/api/feeding?baby_id={{ baby_id }}"

  # Scenario 4: Observation workflow
  - name: "Observation Workflow"
    weight: 25
    flow:
      - post:
          url: "/api/observation"
          json:
            baby_id: "{{ baby_id }}"
            priority_level: "medium"
            notes: "Performance test observation"

      - think: 1

      - get:
          url: "/api/observation?baby_id={{ baby_id }}"